ObschepitRAIPO/src/Documents/ВнесениеИзменениеЦен/ВнесениеИзменениеЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнесениеИзменениеЦен</name>
  <registerRecords>InformationRegister.ЦеныПродуктов</registerRecords>
  <tabularSections>
    <name>Продукты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Продукты</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСтарая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаНовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ObschepitRAIPO/src/Catalogs/Товары/Товары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Товары</name>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.НаценочныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ГруппыИзделий</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеВеса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>EnumRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаБлюда</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Продукты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Продукты</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ObschepitRAIPO/src/Documents/ВнесениеИзменениеЦен/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПродуктыПродуктПриИзменении(Элемент)
	 СтрокаТабличнойЧасти = Элементы.Продукты.ТекущиеДанные;
	 СтрокаТабличнойЧасти.ЦенаСтарая = ОбщиеПроцедуры.ЦенаПродукта(Объект.Дата, СтрокаТабличнойЧасти.Продукт); 
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановкаНовыхЦенНаТовары(Продукт, ЦенаПродукта)
		
	Выборка = Справочники.Товары.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.ПолучитьОбъект();
		Для Каждого СтрокаТабличнойЧасти из Объект.Продукты Цикл
			Если СтрокаТабличнойЧасти.Продукт.Наименование = Продукт.Наименование Тогда
				СтрокаТабличнойЧасти.Цена = ЦенаПродукта;
				СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Цена * СтрокаТабличнойЧасти.Норма;
			КонецЕсли;
			Объект.ЦенаБлюда = Объект.Продукты.Итог("Сумма")/100;
		КонецЦикла;
	Попытка
		Объект.Записать();
	Исключение	
			НСтр("ru = 'Ошибка записи.'");
	КонецПопытки;

	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановкаНовыхЦенНаПродукты(Продукт, ЦенаПродукта)
	Выборка = Справочники.Продукты.Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.ПолучитьОбъект();
		Если Объект.Наименование = Продукт.Наименование Тогда
			Объект.Цена = ЦенаПродукта;
		КонецЕсли;
	Попытка
	Объект.Записать();
	Исключение
			НСтр("ru = 'Ошибка записи.'");
	КонецПопытки;

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Для Каждого Элемент из Объект.Продукты Цикл
		УстановкаНовыхЦенНаПродукты(Элемент.Продукт, Элемент.ЦенаНовая);
	КонецЦикла;
	
	Для Каждого Элемент из Объект.Продукты Цикл
		УстановкаНовыхЦенНаТовары(Элемент.Продукт, Элемент.ЦенаНовая);
	КонецЦикла;
	
КонецПроцедуры
